-- -*- M2-comint -*- hash: 611435285

i1 : A=QQ{x,y,z}

o1 = \displaystyle <pre style="display:inline">
A</pre>

o1 : <pre style="display:inline">
NCPolynomialRing</pre>

i2 : w=x^3-y^2

o2 = \displaystyle <pre style="display:inline">
A</pre>\left\{\textit{cache}\,\Rightarrow\,<pre style="display:inline">
CacheTable</pre>\left\{\ldots1\ldots\right\},\,\textit{ring}\,\Rightarrow\,<pre style="display:inline">
A</pre>,\,\textit{terms}\,\Rightarrow\,<pre style="display:inline">
HashTable</pre>\left\{<pre style="display:inline">
NCMonomial</pre>\left\{\textit{monList}\,\Rightarrow\,\left\{x,\,x,\,x\right\},\,\textit{ring}\,\Rightarrow\,<pre style="display:inline">
A</pre>\right\}\,\Rightarrow\,1,\,<pre style="display:inline">
NCMonomial</pre>\left\{\textit{monList}\,\Rightarrow\,\left\{y,\,y\right\},\,\textit{ring}\,\Rightarrow\,<pre style="display:inline">
A</pre>\right\}\,\Rightarrow\,-1\right\}\right\}

o2 : <pre style="display:inline">
A</pre>

i3 : isHomogeneous w

o3 = \displaystyle <pre style="display:inline">
false</pre>

i4 : setWeights(A, {2,3,1})

o4 = \displaystyle <pre style="display:inline">
A</pre>

o4 : <pre style="display:inline">
NCPolynomialRing</pre>

i5 : isHomogeneous w

o5 = \displaystyle <pre style="display:inline">
true</pre>

i6 : C = QQ{a,b,c}

o6 = \displaystyle <pre style="display:inline">
C</pre>

o6 : <pre style="display:inline">
NCPolynomialRing</pre>

i7 : g = ncMap(C,A,{a^3,b^2,a+b,a-b})

o7 = \displaystyle <pre style="display:inline">
NCRingMap</pre>\left\{\textit{cache}\,\Rightarrow\,<pre style="display:inline">
CacheTable</pre>\left\{\right\},\,\textit{Derivation}\,\Rightarrow\,<pre style="display:inline">
false</pre>,\,\textit{functionHash}\,\Rightarrow\,<pre style="display:inline">
HashTable</pre>\left\{x\,\Rightarrow\,<pre style="display:inline">
C</pre>\left\{\textit{cache}\,\Rightarrow\,<pre style="display:inline">
CacheTable</pre>\left\{\ldots1\ldots\right\},\,\textit{ring}\,\Rightarrow\,<pre style="display:inline">
C</pre>,\,\textit{terms}\,\Rightarrow\,<pre style="display:inline">
HashTable</pre>\left\{<pre style="display:inline">
NCMonomial</pre>\left\{\textit{monList}\,\Rightarrow\,\left\{a,\,a,\,a\right\},\,\textit{ring}\,\Rightarrow\,<pre style="display:inline">
C</pre>\right\}\,\Rightarrow\,1\right\}\right\},\,y\,\Rightarrow\,<pre style="display:inline">
C</pre>\left\{\textit{cache}\,\Rightarrow\,<pre style="display:inline">
CacheTable</pre>\left\{\ldots1\ldots\right\},\,\textit{ring}\,\Rightarrow\,<pre style="display:inline">
C</pre>,\,\textit{terms}\,\Rightarrow\,<pre style="display:inline">
HashTable</pre>\left\{<pre style="display:inline">
NCMonomial</pre>\left\{\textit{monList}\,\Rightarrow\,\left\{b,\,b\right\},\,\textit{ring}\,\Rightarrow\,<pre style="display:inline">
C</pre>\right\}\,\Rightarrow\,1\right\}\right\},\,z\,\Rightarrow\,<pre style="display:inline">
C</pre>\left\{\textit{cache}\,\Rightarrow\,<pre style="display:inline">
CacheTable</pre>\left\{\ldots1\ldots\right\},\,\textit{ring}\,\Rightarrow\,<pre style="display:inline">
C</pre>,\,\textit{terms}\,\Rightarrow\,<pre style="display:inline">
HashTable</pre>\left\{<pre style="display:inline">
NCMonomial</pre>\left\{\textit{monList}\,\Rightarrow\,\left\{a\right\},\,\textit{ring}\,\Rightarrow\,<pre style="display:inline">
C</pre>\right\}\,\Rightarrow\,1,\,<pre style="display:inline">
NCMonomial</pre>\left\{\textit{monList}\,\Rightarrow\,\left\{b\right\},\,\textit{ring}\,\Rightarrow\,<pre style="display:inline">
C</pre>\right\}\,\Rightarrow\,1\right\}\right\}\right\},\,\textit{source}\,\Rightarrow\,<pre style="display:inline">
A</pre>,\,\textit{target}\,\Rightarrow\,<pre style="display:inline">
C</pre>\right\}

o7 : <pre style="display:inline">
NCRingMap</pre>

i8 : isHomogeneous g

o8 = \displaystyle <pre style="display:inline">
false</pre>

i9 : setWeights(A,{3,2,1,1})

o9 = \displaystyle <pre style="display:inline">
A</pre>

o9 : <pre style="display:inline">
NCPolynomialRing</pre>

i10 : isHomogeneous g

o10 = \displaystyle <pre style="display:inline">
true</pre>

i11 : 
