-- -*- M2-comint -*- hash: 780072634

i1 : A=QQ{a, b, c, d, e, f, g, h}

o1 = \displaystyle <pre style="display:inline">
A</pre>

o1 : <pre style="display:inline">
NCPolynomialRing</pre>

i2 : F = a^2+b^2+c^2+d^2+e^2+f^2+g^2+h^2;

i3 : sparseCoeffs(F)

o3 = \displaystyle \begin{pmatrix}
1\\
1\\
1\\
1\\
1\\
1\\
1\\
1\end{pmatrix}

o3 : <pre style="display:inline">
Matrix</pre><pre style="display:inline">
 </pre>{\mathbb Q}^{8}\,\longleftarrow \,{\mathbb Q}^{1}

i4 : bas = flatten entries basis(2,A);

i5 : #bas

o5 = \displaystyle 64

i6 : sparseCoeffs(F,Monomials=>bas)

o6 = \displaystyle \begin{pmatrix}
1\\
0\\
0\\
0\\
0\\
0\\
0\\
0\\
0\\
1\\
0\\
0\\
0\\
0\\
0\\
0\\
0\\
0\\
1\\
0\\
0\\
0\\
0\\
0\\
0\\
0\\
0\\
1\\
0\\
0\\
0\\
0\\
0\\
0\\
0\\
0\\
1\\
0\\
0\\
0\\
0\\
0\\
0\\
0\\
0\\
1\\
0\\
0\\
0\\
0\\
0\\
0\\
0\\
0\\
1\\
0\\
0\\
0\\
0\\
0\\
0\\
0\\
0\\
1\end{pmatrix}

o6 : <pre style="display:inline">
Matrix</pre><pre style="display:inline">
 </pre>{\mathbb Q}^{64}\,\longleftarrow \,{\mathbb Q}^{1}

i7 : sparseCoeffs(toList (10:F),Monomials=>bas)

o7 = \displaystyle \begin{pmatrix}
1&1&1&1&1&1&1&1&1&1\\
0&0&0&0&0&0&0&0&0&0\\
0&0&0&0&0&0&0&0&0&0\\
0&0&0&0&0&0&0&0&0&0\\
0&0&0&0&0&0&0&0&0&0\\
0&0&0&0&0&0&0&0&0&0\\
0&0&0&0&0&0&0&0&0&0\\
0&0&0&0&0&0&0&0&0&0\\
0&0&0&0&0&0&0&0&0&0\\
1&1&1&1&1&1&1&1&1&1\\
0&0&0&0&0&0&0&0&0&0\\
0&0&0&0&0&0&0&0&0&0\\
0&0&0&0&0&0&0&0&0&0\\
0&0&0&0&0&0&0&0&0&0\\
0&0&0&0&0&0&0&0&0&0\\
0&0&0&0&0&0&0&0&0&0\\
0&0&0&0&0&0&0&0&0&0\\
0&0&0&0&0&0&0&0&0&0\\
1&1&1&1&1&1&1&1&1&1\\
0&0&0&0&0&0&0&0&0&0\\
0&0&0&0&0&0&0&0&0&0\\
0&0&0&0&0&0&0&0&0&0\\
0&0&0&0&0&0&0&0&0&0\\
0&0&0&0&0&0&0&0&0&0\\
0&0&0&0&0&0&0&0&0&0\\
0&0&0&0&0&0&0&0&0&0\\
0&0&0&0&0&0&0&0&0&0\\
1&1&1&1&1&1&1&1&1&1\\
0&0&0&0&0&0&0&0&0&0\\
0&0&0&0&0&0&0&0&0&0\\
0&0&0&0&0&0&0&0&0&0\\
0&0&0&0&0&0&0&0&0&0\\
0&0&0&0&0&0&0&0&0&0\\
0&0&0&0&0&0&0&0&0&0\\
0&0&0&0&0&0&0&0&0&0\\
0&0&0&0&0&0&0&0&0&0\\
1&1&1&1&1&1&1&1&1&1\\
0&0&0&0&0&0&0&0&0&0\\
0&0&0&0&0&0&0&0&0&0\\
0&0&0&0&0&0&0&0&0&0\\
0&0&0&0&0&0&0&0&0&0\\
0&0&0&0&0&0&0&0&0&0\\
0&0&0&0&0&0&0&0&0&0\\
0&0&0&0&0&0&0&0&0&0\\
0&0&0&0&0&0&0&0&0&0\\
1&1&1&1&1&1&1&1&1&1\\
0&0&0&0&0&0&0&0&0&0\\
0&0&0&0&0&0&0&0&0&0\\
0&0&0&0&0&0&0&0&0&0\\
0&0&0&0&0&0&0&0&0&0\\
0&0&0&0&0&0&0&0&0&0\\
0&0&0&0&0&0&0&0&0&0\\
0&0&0&0&0&0&0&0&0&0\\
0&0&0&0&0&0&0&0&0&0\\
1&1&1&1&1&1&1&1&1&1\\
0&0&0&0&0&0&0&0&0&0\\
0&0&0&0&0&0&0&0&0&0\\
0&0&0&0&0&0&0&0&0&0\\
0&0&0&0&0&0&0&0&0&0\\
0&0&0&0&0&0&0&0&0&0\\
0&0&0&0&0&0&0&0&0&0\\
0&0&0&0&0&0&0&0&0&0\\
0&0&0&0&0&0&0&0&0&0\\
1&1&1&1&1&1&1&1&1&1\end{pmatrix}

o7 : <pre style="display:inline">
Matrix</pre><pre style="display:inline">
 </pre>{\mathbb Q}^{64}\,\longleftarrow \,{\mathbb Q}^{10}

i8 : 
