-- -*- M2-comint -*- hash: 303501410

i1 : -- The problem of 4 lines w.r.t. random flags
SchPblm = randomSchubertProblemInstance ({{1},{1},{1},{1}},2,4)

o1 = \displaystyle \left\{\left(\left\{1\right\},\begin{pmatrix}
{.781262}-{.624203}\,\mathbf{i}&-{.462954}-{.886382}\,\mathbf{i}&-{.272832}+{.962062}\,\mathbf{i}&-{.670948}-{.741504}\,\mathbf{i}\\
{.9868}+{.161945}\,\mathbf{i}&-{.219207}-{.975678}\,\mathbf{i}&{.778029}-{.628229}\,\mathbf{i}&{.118767}+{.992922}\,\mathbf{i}\\
-{.971549}+{.236839}\,\mathbf{i}&{.157598}-{.987503}\,\mathbf{i}&{.841103}-{.540875}\,\mathbf{i}&-{.396553}+{.918012}\,\mathbf{i}\\
{.893324}+{.449414}\,\mathbf{i}&{.360485}-{.932765}\,\mathbf{i}&-{.651048}+{.759036}\,\mathbf{i}&-{.272372}-{.962192}\,\mathbf{i}\end{pmatrix}\right),\,\left(\left\{1\right\},\begin{pmatrix}
{.696205}+{.717843}\,\mathbf{i}&-{.0281556}+{.999604}\,\mathbf{i}&-{.0562287}-{.998418}\,\mathbf{i}&{.776937}+{.629579}\,\mathbf{i}\\
-{.58234}+{.812945}\,\mathbf{i}&-{.924052}-{.382267}\,\mathbf{i}&{.023444}+{.999725}\,\mathbf{i}&{.570649}+{.821194}\,\mathbf{i}\\
{.486335}-{.873772}\,\mathbf{i}&-{.970803}-{.23988}\,\mathbf{i}&{.701149}-{.713015}\,\mathbf{i}&-{.863646}+{.504099}\,\mathbf{i}\\
-{.783999}-{.620762}\,\mathbf{i}&{.577597}-{.816322}\,\mathbf{i}&{.357971}+{.933733}\,\mathbf{i}&-{.820726}+{.571321}\,\mathbf{i}\end{pmatrix}\right),\,\left(\left\{1\right\},\begin{pmatrix}
-{.746312}-{.665596}\,\mathbf{i}&{.995687}+{.092774}\,\mathbf{i}&{.168661}+{.985674}\,\mathbf{i}&-{.765803}+{.643076}\,\mathbf{i}\\
-{.936289}-{.351232}\,\mathbf{i}&{.701342}-{.712825}\,\mathbf{i}&-{.286823}-{.957983}\,\mathbf{i}&-{.415126}-{.909764}\,\mathbf{i}\\
-{.164243}+{.98642}\,\mathbf{i}&-{.78761}-{.616174}\,\mathbf{i}&{.976163}-{.21704}\,\mathbf{i}&-{.416188}-{.909278}\,\mathbf{i}\\
{.85817}-{.513365}\,\mathbf{i}&{.759918}-{.650019}\,\mathbf{i}&{.482783}+{.87574}\,\mathbf{i}&{.975922}-{.218119}\,\mathbf{i}\end{pmatrix}\right),\,\left(\left\{1\right\},\begin{pmatrix}
{.918399}+{.395655}\,\mathbf{i}&{.719639}-{.694348}\,\mathbf{i}&{.9772}+{.212322}\,\mathbf{i}&-{.998741}-{.0501734}\,\mathbf{i}\\
{.58629}+{.810101}\,\mathbf{i}&-{.554833}-{.831962}\,\mathbf{i}&{.454813}+{.890587}\,\mathbf{i}&-{.698649}-{.715464}\,\mathbf{i}\\
-{.590887}+{.806754}\,\mathbf{i}&-{.726792}+{.686857}\,\mathbf{i}&{.0800129}+{.996794}\,\mathbf{i}&{.742918}+{.669382}\,\mathbf{i}\\
-{.939129}+{.343564}\,\mathbf{i}&-{.616052}-{.787706}\,\mathbf{i}&{.339065}+{.940763}\,\mathbf{i}&-{.99319}-{.116506}\,\mathbf{i}\end{pmatrix}\right)\right\}

o1 : <pre style="display:inline">
List</pre>

i2 : setVerboseLevel 0;

i3 : S = solveSchubertProblem(SchPblm,2,4)

o3 = \displaystyle \left\{\begin{pmatrix}
-{1.65573}-{.600637}\,\mathbf{i}&{.0201935}+{.0437095}\,\mathbf{i}\\
-{1.23037}-{1.66989}\,\mathbf{i}&-{.0308057}-{.00120618}\,\mathbf{i}\\
{1.35971}-{.743988}\,\mathbf{i}&-{.0713133}-{.049047}\,\mathbf{i}\\
-{.397038}-{1.8974}\,\mathbf{i}&{.0102261}-{.024397}\,\mathbf{i}\end{pmatrix},\,\begin{pmatrix}
-{.154703}+{.175591}\,\mathbf{i}&{.0376857}+{.0683239}\,\mathbf{i}\\
-{.801221}-{.0354303}\,\mathbf{i}&-{.00368075}+{.0317504}\,\mathbf{i}\\
{.325581}-{2.08048}\,\mathbf{i}&-{.0350432}-{.250817}\,\mathbf{i}\\
-{.475895}-{.209388}\,\mathbf{i}&-{.0336427}+{.0141017}\,\mathbf{i}\end{pmatrix}\right\}

o3 : <pre style="display:inline">
List</pre>

i4 : assert all(S,s->checkIncidenceSolution(s,SchPblm))

i5 : setVerboseLevel 1;

i6 : S = solveSchubertProblem(SchPblm,2,4)
<pre style="display:inline">
-- playCheckers</pre>
-- cpu time = .00497449
<pre style="display:inline">
-- making a recursive call to resolveNode</pre>
<pre style="display:inline">
-- playCheckers</pre>
-- cpu time = .0025346
<pre style="display:inline">
-- making a recursive call to resolveNode</pre>
<pre style="display:inline">
-- playCheckers</pre>
-- cpu time = .00307246
<pre style="display:inline">
resolveNode reached node of no remaining conditions</pre>
-- time to make equations: .00443138
Setup time: 0
Computing time:0
 -- trackHomotopy time = .00941618 sec. for [{0, 1, 2, 3}, {0, infinity, 2, infinity}]
-- time of performing one checker move: .0136572
-- time of performing one checker move: .00112097
-- time of performing one checker move: .000969697
-- time to make equations: .00422915
Setup time: 0
Computing time:0
 -- trackHomotopy time = .0196908 sec. for [{1, 2, 3, 0}, {1, infinity, infinity, 2}]
-- time of performing one checker move: .0136165
-- time to make equations: .00465943
Setup time: 0
Computing time:0
 -- trackHomotopy time = .00556093 sec. for [{1, 3, 2, 0}, {1, infinity, infinity, 2}]
-- time of performing one checker move: .0210697
-- time to make equations: .00463536
Setup time: 0
Computing time:0
 -- trackHomotopy time = .00555888 sec. for [{2, 3, 1, 0}, {2, infinity, infinity, 1}]
-- time of performing one checker move: .0142902
-- time to make equations: .00997266
Setup time: 0
Computing time:0
 -- trackHomotopy time = .00943874 sec. for [{0, 1, 2, 3}, {infinity, 1, 2, infinity}]
-- time of performing one checker move: .0235847
-- time to make equations: .00942352
Setup time: 0
Computing time:0
 -- trackHomotopy time = .0066936 sec. for [{0, 1, 3, 2}, {infinity, 1, infinity, 2}]
-- time of performing one checker move: .0200455
-- time of performing one checker move: .000949813
-- time of performing one checker move: .000940289
-- time to make equations: .00962794
Setup time: 0
Computing time:0
 -- trackHomotopy time = .0384299 sec. for [{1, 3, 2, 0}, {infinity, 3, infinity, 1}]
-- time of performing one checker move: .0265469
<pre style="display:inline">
-- making a recursive call to resolveNode</pre>
<pre style="display:inline">
-- playCheckers</pre>
-- cpu time = .00251083
<pre style="display:inline">
-- making a recursive call to resolveNode</pre>
<pre style="display:inline">
-- playCheckers</pre>
-- cpu time = .00031005
<pre style="display:inline">
resolveNode reached node of no remaining conditions</pre>
-- time to make equations: .00455179
Setup time: 0
Computing time:0
 -- trackHomotopy time = .0116487 sec. for [{0, 1, 2, 3}, {0, infinity, 2, infinity}]
-- time of performing one checker move: .0143736
-- time of performing one checker move: .00426531
-- time to make equations: .00423214
Setup time: 0
Computing time:0
 -- trackHomotopy time = .00517876 sec. for [{0, 2, 3, 1}, {0, infinity, infinity, 2}]
-- time of performing one checker move: .0131431
-- time of performing one checker move: .000890862
-- time of performing one checker move: .000650883
-- time of performing one checker move: .000852873
-- time of performing one checker move: .00104246
-- time of performing one checker move: .000746932
-- time of performing one checker move: .000990991
-- time of performing one checker move: .000997085
-- time to make equations: .00912602
Setup time: 0
Computing time:0
 -- trackHomotopy time = .00671616 sec. for [{1, 3, 2, 0}, {1, infinity, infinity, 3}]
-- time of performing one checker move: .0197744
-- time of performing one checker move: .0015329

o6 = \displaystyle \left\{\begin{pmatrix}
-{1.65573}-{.600637}\,\mathbf{i}&{.0201935}+{.0437095}\,\mathbf{i}\\
-{1.23037}-{1.66989}\,\mathbf{i}&-{.0308057}-{.00120618}\,\mathbf{i}\\
{1.35971}-{.743988}\,\mathbf{i}&-{.0713133}-{.049047}\,\mathbf{i}\\
-{.397038}-{1.8974}\,\mathbf{i}&{.0102261}-{.024397}\,\mathbf{i}\end{pmatrix},\,\begin{pmatrix}
-{.154703}+{.175591}\,\mathbf{i}&{.0376857}+{.0683239}\,\mathbf{i}\\
-{.801221}-{.0354303}\,\mathbf{i}&-{.00368075}+{.0317504}\,\mathbf{i}\\
{.325581}-{2.08048}\,\mathbf{i}&-{.0350432}-{.250817}\,\mathbf{i}\\
-{.475895}-{.209388}\,\mathbf{i}&-{.0336427}+{.0141017}\,\mathbf{i}\end{pmatrix}\right\}

o6 : <pre style="display:inline">
List</pre>

i7 : assert all(S,s->checkIncidenceSolution(s,SchPblm))

i8 : 
