-- -*- M2-comint -*- hash: 1058705454

i1 : K=QQ;

i2 : R=K[v,u,z];

i3 : I=ideal(v^8-u^3*(z+u)^5);

o3 : <pre style="display:inline">
Ideal</pre><pre style="display:inline">
 of </pre>R

i4 : J=ideal(u^6+4*u^5*z+6*u^4*z^2+4*u^3*z^3+u^2*z^4,v*u^5+3*v*u^4*z+3*v*u^3*z^2+v*u^2*z^3,v^2*u^4+3*v^2*u^3*z+3*v^2*u^2*z^2+v^2*u*z^3,v^3*u^3+2*v^3*u^2*z+v^3*u*z^2,v^4*u^2+v^4*u*z,v^5*u+v^5*z,v^6);

o4 : <pre style="display:inline">
Ideal</pre><pre style="display:inline">
 of </pre>R

i5 : rParametrizePlaneCurve(I,J)

o5 = \displaystyle \begin{pmatrix}
{t}_{0}^{2}{t}_{1}{t}_{2}\\
-{t}_{2}^{4}\\
-{t}_{0}^{4}+{t}_{2}^{4}\end{pmatrix}

o5 : <pre style="display:inline">
Matrix</pre><pre style="display:inline">
 </pre>\left({\frac{{\mathbb Q}\left[{t}_{0},{t}_{1},{t}_{2}\right]}{{t}_{1}^{2}-{t}_{0}{t}_{2}}}\right)^{3}\,\longleftarrow \,\left({\frac{{\mathbb Q}\left[{t}_{0},{t}_{1},{t}_{2}\right]}{{t}_{1}^{2}-{t}_{0}{t}_{2}}}\right)^{1}

i6 : rParametrizePlaneCurve(I,J,parametrizeConic=>true)

o6 = \displaystyle \begin{pmatrix}
{t}_{0}^{3}{t}_{1}^{5}\\
-{t}_{0}^{8}\\
{t}_{0}^{8}-{t}_{1}^{8}\end{pmatrix}

o6 : <pre style="display:inline">
Matrix</pre><pre style="display:inline">
 </pre>\left({{\mathbb Q}\left[{t}_{0},{t}_{1}\right]}\right)^{3}\,\longleftarrow \,\left({{\mathbb Q}\left[{t}_{0},{t}_{1}\right]}\right)^{1}

i7 : K=QQ;

i8 : R=K[v,u,z];

i9 : I=ideal(u^5+2*u^2*v*z^2+2*u^3*v*z+u*v^2*z^2-4*u*v^3*z+2*v^5);

o9 : <pre style="display:inline">
Ideal</pre><pre style="display:inline">
 of </pre>R

i10 : J=ideal(u^3+v*u*z,v*u^2+v^2*z,v^2*u-u^2*z,v^3-v*u*z);

o10 : <pre style="display:inline">
Ideal</pre><pre style="display:inline">
 of </pre>R

i11 : rParametrizePlaneCurve(I,J)

o11 = \displaystyle \begin{pmatrix}
-2\,{t}_{0}^{2}{t}_{1}^{3}+{t}_{0}{t}_{1}^{4}\\
4\,{t}_{0}^{4}{t}_{1}-2\,{t}_{0}^{3}{t}_{1}^{2}\\
-4\,{t}_{0}^{5}+{t}_{1}^{5}\end{pmatrix}

o11 : <pre style="display:inline">
Matrix</pre><pre style="display:inline">
 </pre>\left({{\mathbb Q}\left[{t}_{0},{t}_{1}\right]}\right)^{3}\,\longleftarrow \,\left({{\mathbb Q}\left[{t}_{0},{t}_{1}\right]}\right)^{1}

i12 : 
