-- -*- M2-comint -*- {* hash: 2104268545 *}
--loading configuration for package "Bertini" from file /Users/elizabethgross/Library/Application Support/Macaulay2/init-Bertini.m2

i1 : R = CC[x,y,z];

i2 : f = {"(x^2+y^2-z^2)*(z-x)",toString (hold (x^2+y^2-z^2)*(z+y)),z-1};

i3 : sols = bertiniZeroDimSolve(f,AllowStrings=>{x,y,z})
Temporary directory for input and output files:/var/folders/kq/sl97ymz57zd0w0hwh4drs33c0000gn/T/M2-18999-0/0

The version of Bertini you have installed on your computer was used for this run. 
Bertini is under ongoing development by D. Bates, J. Hauenstein, A. Sommese, and C. Wampler.


o3 = {(1, 1.72379e-14+1.43187e-13*ii, 1), {1, -1, 1}, (1,
     ------------------------------------------------------------------------
     1.44796e-14+1.67172e-13*ii, 1), (-1.41964+.606291*ii,
     ------------------------------------------------------------------------
     .771845+1.11514*ii, 1), (.839287, -.543689, 1), (-1.41964-.606291*ii,
     ------------------------------------------------------------------------
     .771845-1.11514*ii, 1), (-1, -2.16393e-16-1.68211e-15*ii, 1)}

o3 : List

i4 : R=CC[x,y,z];--u1,u2 are parameters

i5 : f1=x^2+y^2-z^2;

i6 : f2="u1*x+u2*y";

i7 : f3=z-1;

i8 : finalParameters={{0,1}};

i9 : bPH=bertiniParameterHomotopy( {f1,f2,f3}, {u1,u2},{finalParameters },AllowStrings=>{x,y,z})
Temporary directory for input and output files:/var/folders/kq/sl97ymz57zd0w0hwh4drs33c0000gn/T/M2-18999-0/1

The version of Bertini you have installed on your computer was used for this run. 
Bertini is under ongoing development by D. Bates, J. Hauenstein, A. Sommese, and C. Wampler.


o9 = {{{1, -1.39102e-17+1.75205e-17*ii, 1}, {-1, -1.52579e-17-2.8759e-17*ii,
     ------------------------------------------------------------------------
     1}}}

o9 : List

i10 : R=CC[x,t1];

i11 : f1="x^2+cos(1-t1)-2*exp(1-t1)";

i12 : H={f1};

i13 : sol1 = point {{1}};

i14 : sol2 = point {{-1}};

i15 : S1={sol1,sol2}--solutions to H when t=1

o15 = {sol1, sol2}

o15 : List

i16 : S0 = bertiniTrackHomotopy (H, t1, S1,AllowStrings=>{x}) --solutions to H when t=0|
Temporary directory for input and output files:/var/folders/kq/sl97ymz57zd0w0hwh4drs33c0000gn/T/M2-18999-0/3

The version of Bertini you have installed on your computer was used for this run. 
Bertini is under ongoing development by D. Bates, J. Hauenstein, A. Sommese, and C. Wampler.


o16 = {{2.21275}, {-2.21275}}

o16 : List

i17 : peek S0

o17 = {Point{ConditionNumber => 1           }, Point{ConditionNumber => 1           }}
             Coordinates => {2.21275}                Coordinates => {-2.21275}
             CycleNumber => 1                        CycleNumber => 1
             FunctionResidual => 8.88178e-16         FunctionResidual => 8.88178e-16
             LastT => .0015625                       LastT => .0015625
             MaximumPrecision => 52                  MaximumPrecision => 52
             NewtonResidual => 0                     NewtonResidual => 0
             SolutionNumber => 1                     SolutionNumber => -1

i18 : 
