-- -*- M2-comint -*- {* hash: -1067040464 *}
-- COMPILE TIME: Oct 14 2015, 14:51:21
--loading configuration for package "Bertini" from file /nethome/aleykin3/.Macaulay2/init-Bertini.m2

i1 : R = CC[x,y,z];

i2 : f = {(x^2+y^2-z^2)*(z-x),(x^2+y^2-z^2)*(z+y)};

i3 : bertiniPosDimSolve(f,ISPROJECTIVE=>1);
Temporary directory for input and output files:/tmp/M2-29547-0/1

The version of Bertini 
	    you have installed on your computer 
	    was used for this run. 
Bertini is under ongoing development by 
	    D. Bates, J. Hauenstein, A. Sommese, and C. Wampler.


i4 : R=CC[x,y,z,u1,u2];--u1,u2 are parameters

i5 : f1=x^2+y^2-z^2;

i6 : f2=u1*x+u2*y;

i7 : finalParameters={{0,1}};

i8 : bPH=bertiniParameterHomotopy( {f1,f2}, {u1,u2},{finalParameters },ISPROJECTIVE=>1)
Temporary directory for input and output files:/tmp/M2-29547-0/2

The version of Bertini 
	    you have installed on your computer 
	    was used for this run. 
Bertini is under ongoing development by 
	    D. Bates, J. Hauenstein, A. Sommese, and C. Wampler.


o8 = {{{-.677815+.038577*ii, -1.21973e-18-7.99599e-19*ii,
     ------------------------------------------------------------------------
     .677815-.038577*ii}, {-.052248+1.07253*ii, 3.33392e-18-1.09504e-17*ii,
     ------------------------------------------------------------------------
     -.052248+1.07253*ii}}}

o8 : List

i9 : 
