-- -*- M2-comint -*- hash: -1393920928
--loading configuration for package "FourTiTwo" from file /home/aleykin3/.Macaulay2/init-FourTiTwo.m2
--loading configuration for package "Topcom" from file /home/aleykin3/.Macaulay2/init-Topcom.m2
-- COMPILE TIME: Oct 31 2019, 08:32:16
--loading configuration for package "Bertini" from file /home/aleykin3/.Macaulay2/init-Bertini.m2

i1 : R = CC[x,t]; -- include the path variable in the ring

i2 : H = { (x^2-1)*t + (x^2-2)*(1-t)};

i3 : sol1 = point {{1}};

i4 : sol2 = point {{-1}};

i5 : S1= { sol1, sol2  };--solutions to H when t=1

i6 : S0 = bertiniTrackHomotopy (t, H, S1) --solutions to H when t=0

o6 = {{-1.41421}, {1.41421}}

o6 : List

i7 : peek S0_0

o7 = Point{ConditionNumber => 1           }
           Coordinates => {-1.41421}
           CycleNumber => 1
           FunctionResidual => 4.44089e-16
           LastT => .0015625
           MaximumPrecision => 52
           Multiplicity => 1
           NewtonResidual => 0
           SolutionNumber => -1
           SolutionStatus => Regular

i8 : R=CC[x,y,t]; -- include the path variable in the ring

i9 : f1=(x^2-y^2);

i10 : f2=(2*x^2-3*x*y+5*y^2);

i11 : H = { f1*t + f2*(1-t)}; --H is a list of polynomials in x,y,t

i12 : sol1=    point{{1,1}}--{{x,y}} coordinates

o12 = sol1

o12 : Point

i13 : sol2=    point{{ -1,1}}

o13 = sol2

o13 : Point

i14 : S1={sol1,sol2}--solutions to H when t=1

o14 = {sol1, sol2}

o14 : List

i15 : S0=bertiniTrackHomotopy(t, H, S1, IsProjective=>1) --solutions to H when t=0

o15 = {{.683735-.60461*ii, .541753+.199305*ii}, {1.34619+.263739*ii,
      -----------------------------------------------------------------------
      .550701-.670406*ii}}

o15 : List

i16 : 
