-- -*- M2-comint -*- hash: 1488243299
--loading configuration for package "FourTiTwo" from file /home/aleykin3/.Macaulay2/init-FourTiTwo.m2
--loading configuration for package "Topcom" from file /home/aleykin3/.Macaulay2/init-Topcom.m2
-- COMPILE TIME: Oct 31 2019, 08:32:16
--loading configuration for package "Bertini" from file /home/aleykin3/.Macaulay2/init-Bertini.m2

i1 : R = CC[x,y];

i2 : F = {x^2-1,y^2-2};

i3 : S = bertiniZeroDimSolve F

o3 = {{1, 1.41421}, {1, -1.41421}, {-1, 1.41421}, {-1, -1.41421}}

o3 : List

i4 : peek S_0

o4 = Point{AccuracyEst => 9.13511e-15       }
           AccuracyEstInternal => 2.0381e-14
           ConditionNumber => 284.817
           Coordinates => {1, 1.41421}
           CycleNumber => 1
           FinalTValue => .000390625
           FunctionResidual => 7.94411e-15
           MaxPrecisionUtilized => 52
           Multiplicity => 1
           NewtonResidual => 5.00946e-15
           PathNumber => 0
           PathsWithSameEndpoint => {}
           PrecisionIncreased => 0
           SolutionNumber => 3

i5 : R = CC[x];

i6 : F = {x^2*(x-1)};

i7 : S = bertiniZeroDimSolve F

o7 = {{1}, {3.96424e-14+3.73513e-14*ii}}

o7 : List

i8 : B = bertiniZeroDimSolve(F,UseRegeneration=>1)

o8 = {{1}}

o8 : List

i9 : 
