-- -*- M2-comint -*- hash: 704393788

i1 : R = QQ[x,y,z]

o1 = R

o1 : PolynomialRing

i2 : F = {(y^2+x^2+z^2-1)*x,(y^2+x^2+z^2-1)*y}

       3      2      2       2     3      2
o2 = {x  + x*y  + x*z  - x, x y + y  + y*z  - y}

o2 : List

i3 : S = bertiniPosDimSolve F

o3 = S

o3 : NumericalVariety

i4 : S#1_0#Points -- 1_0 chooses the first witness set in dimension 1

o4 = {{-1.92365e-61+4.70655e-62*ii, 2.0809e-61+5.7384e-62*ii, .0526028+.36213*ii}}

o4 : VerticalList

i5 : S#1 --first specify dimension

o5 = {(dim=1,deg=1)}

o5 : List

i6 : peek oo_0 --then list position

o6 = WitnessSet{ComponentNumber => 0                                                                             }
                IsIrreducible => true
                Points => {{-1.92365e-61+4.70655e-62*ii, 2.0809e-61+5.7384e-62*ii, .0526028+.36213*ii}}
                Slice => | .662635+.650536ii .359389-.656455ii -.113703+1.27646ii .468226-.0259701ii |
                WitnessDataFileName => /var/folders/46/9b86vqxj4hjcngvy7kd7sb140000gn/T/M2-74779-0/1/witness_data
                                     3      2      2       2     3      2
                Equations => ideal (x  + x*y  + x*z  - x, x y + y  + y*z  - y)

i7 : PD=primaryDecomposition( ideal F)

             2    2    2
o7 = {ideal(x  + y  + z  - 1), ideal (y, x)}

o7 : List

i8 : dim PD_0

o8 = 2

i9 : degree PD_0

o9 = 2

i10 : dim PD_1

o10 = 1

i11 : degree PD_1

o11 = 1

i12 : 
