-- -*- M2-comint -*- hash: 1488243299

i1 : R = CC[x,y];

i2 : F = {x^2-1,y^2-2};

i3 : S = bertiniZeroDimSolve F

o3 = {{1, 1.41421}, {1, -1.41421}, {-1, 1.41421}, {-1, -1.41421}}

o3 : List

i4 : peek S_0

o4 = Point{AccuracyEst => 4.49338e-11        }
           AccuracyEstInternal => 7.79225e-12
           ConditionNumber => 2.37577
           Coordinates => {1, 1.41421}
           CycleNumber => 1
           FinalTValue => .0015625
           FunctionResidual => 4.22465e-15
           MaxPrecisionUtilized => 52
           Multiplicity => 1
           NewtonResidual => 2.85482e-17
           PathNumber => 0
           PathsWithSameEndpoint => {}
           PrecisionIncreased => 0
           SolutionNumber => 0

i5 : R = CC[x];

i6 : F = {x^2*(x-1)};

i7 : S = bertiniZeroDimSolve F

o7 = {{1}, {-4.3305e-15+6.29344e-15*ii}}

o7 : List

i8 : B = bertiniZeroDimSolve(F,UseRegeneration=>1)

o8 = {{1}}

o8 : List

i9 : 
