-- -*- M2-comint -*- hash: 704393788
--loading configuration for package "FourTiTwo" from file /home/aleykin3/.Macaulay2/init-FourTiTwo.m2
--loading configuration for package "Topcom" from file /home/aleykin3/.Macaulay2/init-Topcom.m2
-- COMPILE TIME: Oct 31 2019, 08:32:16
--loading configuration for package "Bertini" from file /home/aleykin3/.Macaulay2/init-Bertini.m2

i1 : R = QQ[x,y,z]

o1 = R

o1 : PolynomialRing

i2 : F = {(y^2+x^2+z^2-1)*x,(y^2+x^2+z^2-1)*y}

       3      2      2       2     3      2
o2 = {x  + x*y  + x*z  - x, x y + y  + y*z  - y}

o2 : List

i3 : S = bertiniPosDimSolve F

o3 = S

o3 : NumericalVariety

i4 : S#1_0#Points -- 1_0 chooses the first witness set in dimension 1

o4 = {{5.40085e-72+9.7017e-72*ii, 2.17445e-72+1.0447e-71*ii, .0100757+.375105*ii}}

o4 : VerticalList

i5 : S#1 --first specify dimension

o5 = {(dim=1,deg=1)}

o5 : List

i6 : peek oo_0 --then list position

o6 = WitnessSet{ComponentNumber => 0                                                                   }
                IsIrreducible => true
                Points => {{5.40085e-72+9.7017e-72*ii, 2.17445e-72+1.0447e-71*ii, .0100757+.375105*ii}}
                Slice => | .160219-.172429ii .661607-2.7306ii 1.02903-3.75384ii .809161+.713024ii |
                WitnessDataFileName => /tmp/M2-25838-0/1/witness_data
                                     3      2      2       2     3      2
                Equations => ideal (x  + x*y  + x*z  - x, x y + y  + y*z  - y)

i7 : PD=primaryDecomposition( ideal F)

             2    2    2
o7 = {ideal(x  + y  + z  - 1), ideal (y, x)}

o7 : List

i8 : dim PD_0

o8 = 2

i9 : degree PD_0

o9 = 2

i10 : dim PD_1

o10 = 1

i11 : degree PD_1

o11 = 1

i12 : 
