-- -*- M2-comint -*- hash: 1241447274
--loading configuration for package "FourTiTwo" from file /home/aleykin3/.Macaulay2/init-FourTiTwo.m2
--loading configuration for package "Topcom" from file /home/aleykin3/.Macaulay2/init-Topcom.m2
-- COMPILE TIME: Oct 31 2019, 08:32:16
--loading configuration for package "Bertini" from file /home/aleykin3/.Macaulay2/init-Bertini.m2

i1 : R=QQ[x1,x2,y]

o1 = R

o1 : PolynomialRing

i2 : theDir = temporaryFileName()

o2 = /tmp/M2-25985-0/1

i3 : makeDirectory theDir

i4 : makeB'InputFile(theDir,
             BertiniInputConfiguration=>{MPType=>2},
         AffVariableGroup=>{{x1,x2},{y}},
             B'Polynomials=>{y*(x1+x2+1)^2+1,x1-x2+1,y-2})

o4 = /tmp/M2-25985-0/1/input

o4 : File

i5 : R=QQ[x1,x2,y,X]

o5 = R

o5 : PolynomialRing

i6 : makeB'InputFile(theDir,
             BertiniInputConfiguration=>{MPType=>2},
         AffVariableGroup=>{{x1,x2},{y}},
             NamePolynomials=>{f1,f2,f3},
             B'Functions=>{
            {X,x1+x2+1},
            {f1,y*X^2+1},
            {f2,x1-x2+1},
            {f3,y-2}})

o6 = /tmp/M2-25985-0/1/input

o6 : File

i7 : R=QQ[x1,x2,y,X]

o7 = R

o7 : PolynomialRing

i8 : makeB'InputFile(theDir,
              BertiniInputConfiguration=>{MPype=>2},
          AffVariableGroup=>{{x1,x2},{y}},
               B'Polynomials=>{y*X^2+1,x1-x2+1,y-2},
                B'Functions=>{
                   {X,x1+x2+1}})

o8 = /tmp/M2-25985-0/1/input

o8 : File

i9 : 
