-- -*- M2-comint -*- hash: -822686202

i1 : sliceType={1,1}

o1 = \displaystyle \left\{1,\,1\right\}

o1 : <pre style="display:inline">
List</pre>

i2 : variableGroups={{x0,x1},{y0,y1,y2}}

o2 = \displaystyle \left\{\left\{\textit{x0},\,\textit{x1}\right\},\,\left\{\textit{y0},\,\textit{y1},\,\textit{y2}\right\}\right\}

o2 : <pre style="display:inline">
List</pre>

i3 : xySlice=makeB'Slice(sliceType,variableGroups)

o3 = \displaystyle <pre style="display:inline">
B'Slice</pre>\left\{\ldots4\ldots\right\}

o3 : <pre style="display:inline">
B'Slice</pre>

i4 : peek xySlice

o4 = <pre style="display:inline-table;vertical-align:0%">
B'Slice{B'NumberCoefficients => {{1.49144+.713846*ii, -.840113+1.1986*ii}, {.014842+1.23548*ii, -.214468+.911293*ii, -.486176+.400577*ii}}                       }<br/>        B'SectionString => {(1.49144+.713846*ii)*(x0)+(-.840113+1.1986*ii)*(x1), (.014842+1.23548*ii)*(y0)+(-.214468+.911293*ii)*(y1)+(-.486176+.400577*ii)*(y2)}<br/>        ListB'Sections => {B'Section{...2...}, B'Section{...2...}}<br/>        NameB'Slice => null<br/></pre>

i5 : for i in  xySlice#B'SectionString do print i
<pre style="display:inline">
(1.49144+.713846*ii)*(x0)+(-.840113+1.1986*ii)*(x1)</pre>
<pre style="display:inline">
(.014842+1.23548*ii)*(y0)+(-.214468+.911293*ii)*(y1)+(-.486176+.400577*ii)*(y2)</pre>

i6 : aSlice=makeB'Slice(3,{x,y,z,1},NameB'Slice=>"f");

i7 : aSlice#NameB'Slice

o7 = \displaystyle \left\{<pre style="display:inline">
f0</pre>,\,<pre style="display:inline">
f1</pre>,\,<pre style="display:inline">
f2</pre>\right\}

o7 : <pre style="display:inline">
List</pre>

i8 : makeB'InputFile(storeBM2Files,AffVariableGroup=>{x,y,z},B'Functions=>{aSlice},NamePolynomials=>{"f0","f1","f2"});

i9 : f1="x0*y0+x1*y0+x2*y2"

o9 = <pre style="display:inline">
x0*y0+x1*y0+x2*y2</pre>

i10 : f2="x0*y0^2+x1*y1*y2+x2*y0*y2"

o10 = <pre style="display:inline">
x0*y0^2+x1*y1*y2+x2*y0*y2</pre>

i11 : variableGroups={{x0,x1,x2},{y0,y1,y2}}

o11 = \displaystyle \left\{\left\{\textit{x0},\,\textit{x1},\,\textit{x2}\right\},\,\left\{\textit{y0},\,\textit{y1},\,\textit{y2}\right\}\right\}

o11 : <pre style="display:inline">
List</pre>

i12 : xxSlice=makeB'Slice({2,0},variableGroups)

o12 = \displaystyle <pre style="display:inline">
B'Slice</pre>\left\{\ldots4\ldots\right\}

o12 : <pre style="display:inline">
B'Slice</pre>

i13 : xySlice=makeB'Slice({1,1},variableGroups)

o13 = \displaystyle <pre style="display:inline">
B'Slice</pre>\left\{\ldots4\ldots\right\}

o13 : <pre style="display:inline">
B'Slice</pre>

i14 : yySlice=makeB'Slice({0,2},variableGroups)

o14 = \displaystyle <pre style="display:inline">
B'Slice</pre>\left\{\ldots4\ldots\right\}

o14 : <pre style="display:inline">
B'Slice</pre>

i15 : makeB'InputFile(storeBM2Files,
    HomVariableGroup=>variableGroups,
    B'Polynomials=>{f1,f2}|xxSlice#ListB'Sections);

i16 : runBertini(storeBM2Files)

i17 : xxDegree=#importSolutionsFile(storeBM2Files)

o17 = \displaystyle 2

i18 : makeB'InputFile(storeBM2Files,
    HomVariableGroup=>variableGroups,
    B'Polynomials=>{f1,f2}|xySlice#ListB'Sections);

i19 : runBertini(storeBM2Files)

i20 : xyDegree=#importSolutionsFile(storeBM2Files)

o20 = \displaystyle 3

i21 : makeB'InputFile(storeBM2Files,
    HomVariableGroup=>variableGroups,
    B'Polynomials=>{f1,f2}|yySlice#ListB'Sections);

i22 : runBertini(storeBM2Files)

i23 : yyDegree=#importSolutionsFile(storeBM2Files)

o23 = \displaystyle 1

i24 : 
