-- -*- M2-comint -*- hash: 438712966

i1 : valueBM2("1.22e-2 4e-5")

o1 = \displaystyle {.0122}+{.00004}\,\mathbf{i}

o1 : {\mathbb C}<pre style="display:inline">
 (of precision </pre>53<pre style="display:inline">
)</pre>

i2 : valueBM2("1.22 4e-5")

o2 = \displaystyle {1.22}+{.00004}\,\mathbf{i}

o2 : {\mathbb C}<pre style="display:inline">
 (of precision </pre>53<pre style="display:inline">
)</pre>

i3 : valueBM2("1.22 4")

o3 = \displaystyle {1.22}+{4}\,\mathbf{i}

o3 : {\mathbb C}<pre style="display:inline">
 (of precision </pre>53<pre style="display:inline">
)</pre>

i4 : valueBM2("1.22e+2 4 ")

o4 = \displaystyle {122}+{4}\,\mathbf{i}

o4 : {\mathbb C}<pre style="display:inline">
 (of precision </pre>53<pre style="display:inline">
)</pre>

i5 : n1=valueBM2("1.11",M2Precision=>52)

o5 = \displaystyle {1.11}

o5 : {\mathbb R}<pre style="display:inline">
 (of precision </pre>52<pre style="display:inline">
)</pre>

i6 : n2=valueBM2("1.11",M2Precision=>300)

o6 = \displaystyle {1.11}

o6 : {\mathbb R}<pre style="display:inline">
 (of precision </pre>300<pre style="display:inline">
)</pre>

i7 : toExternalString n1

o7 = <pre style="display:inline">
.11099999999999999p52e1</pre>

i8 : toExternalString n2

o8 = <pre style="display:inline">
.11100000000000000000000000000000000000000000000000000000000000000000000000000000000000000003p300e1</pre>

i9 : 
