-- -*- M2-comint -*- hash: 1569677465

i1 : time D77 = realRankBoundary(7,7)
     -- used 0.419554 seconds

o1 = \displaystyle <pre style="display:inline">
CoincidentRootLocus</pre>\left\{\ldots10\ldots\right\}

o1 : <pre style="display:inline">
CoincidentRootLocus</pre>

i2 : describe D77

o2 = <pre style="display:inline">
Coincident root locus associated with the partition {2, 1, 1, 1, 1, 1} defined over QQ
ambient: P^7 = Proj(QQ[t_0, t_1, t_2, t_3, t_4, t_5, t_6, t_7])
dim    = 6
codim  = 1
degree = 12
The singular locus is the union of the coincident root loci associated with the partitions: 
({2, 2, 1, 1, 1},{3, 1, 1, 1, 1})
The defining polynomial has 1103 terms of degree 12</pre>

i3 : time D64 = realRankBoundary(6,4)
     -- used 1.92011 seconds

o3 = \displaystyle \left\{<pre style="display:inline">
JoinOfCoincidentRootLoci</pre>\left\{\ldots6\ldots\right\},\,<pre style="display:inline">
JoinOfCoincidentRootLoci</pre>\left\{\ldots6\ldots\right\}\right\}

o3 : <pre style="display:inline">
List</pre>

i4 : describe first D64

o4 = <pre style="display:inline">
Dual of the coincident root locus associated with the partition {3, 3} defined over QQ
which coincides with the join of the coincident root loci associated with the partitions: ({5, 1},{5, 1})
ambient: P^6 = Proj(QQ[t_0, t_1, t_2, t_3, t_4, t_5, t_6])
dim    = 5
codim  = 1
degree = 12
The defining polynomial has 560 terms of degree 12</pre>

i5 : describe last D64

o5 = <pre style="display:inline">
Dual of the coincident root locus associated with the partition {4, 2} defined over QQ
which coincides with the join of the coincident root loci associated with the partitions: ({4, 1, 1},{6})
ambient: P^6 = Proj(QQ[t_0, t_1, t_2, t_3, t_4, t_5, t_6])
dim    = 5
codim  = 1
degree = 18
The defining polynomial has 3140 terms of degree 18</pre>

i6 : time D74 = realRankBoundary(7,4)
     -- used 0.365573 seconds

o6 = \displaystyle <pre style="display:inline">
JoinOfCoincidentRootLoci</pre>\left\{\ldots6\ldots\right\}

o6 : <pre style="display:inline">
JoinOfCoincidentRootLoci</pre>

i7 : describe D74

o7 = <pre style="display:inline">
Dual of the coincident root locus associated with the partition {3, 2, 2} defined over QQ
which coincides with the join of the coincident root loci associated with the partitions:
({6, 1},{7},{7})
ambient: P^7 = Proj(QQ[t_0, t_1, t_2, t_3, t_4, t_5, t_6, t_7])
dim    = 6
codim  = 1
degree = 24</pre>

i8 : time D75 = realRankBoundary(7,5)
     -- used 0.209709 seconds

o8 = \displaystyle \left\{<pre style="display:inline">
JoinOfCoincidentRootLoci</pre>\left\{\ldots6\ldots\right\},\,<pre style="display:inline">
JoinOfCoincidentRootLoci</pre>\left\{\ldots6\ldots\right\},\,<pre style="display:inline">
JoinOfCoincidentRootLoci</pre>\left\{\ldots6\ldots\right\}\right\}

o8 : <pre style="display:inline">
List</pre>

i9 : describe D75_0

o9 = <pre style="display:inline">
Dual of the coincident root locus associated with the partition {3, 2, 2} defined over QQ
which coincides with the join of the coincident root loci associated with the partitions:
({6, 1},{7},{7})
ambient: P^7 = Proj(QQ[t_0, t_1, t_2, t_3, t_4, t_5, t_6, t_7])
dim    = 6
codim  = 1
degree = 24</pre>

i10 : describe D75_1

o10 = <pre style="display:inline">
Dual of the coincident root locus associated with the partition {4, 3} defined over QQ
which coincides with the join of the coincident root loci associated with the partitions: ({5, 1, 1},{6, 1})
ambient: P^7 = Proj(QQ[t_0, t_1, t_2, t_3, t_4, t_5, t_6, t_7])
dim    = 6
codim  = 1
degree = 36</pre>

i11 : describe D75_2

o11 = <pre style="display:inline">
Dual of the coincident root locus associated with the partition {5, 2} defined over QQ
which coincides with the join of the coincident root loci associated with the partitions: ({4, 1, 1, 1},{7})
ambient: P^7 = Proj(QQ[t_0, t_1, t_2, t_3, t_4, t_5, t_6, t_7])
dim    = 6
codim  = 1
degree = 24</pre>

i12 : time D76 = realRankBoundary(7,6)
     -- used 0.000324866 seconds

o12 = \displaystyle \left\{<pre style="display:inline">
JoinOfCoincidentRootLoci</pre>\left\{\ldots6\ldots\right\},\,<pre style="display:inline">
JoinOfCoincidentRootLoci</pre>\left\{\ldots6\ldots\right\},\,<pre style="display:inline">
CoincidentRootLocus</pre>\left\{\ldots10\ldots\right\}\right\}

o12 : <pre style="display:inline">
List</pre>

i13 : describe D76_0

o13 = <pre style="display:inline">
Dual of the coincident root locus associated with the partition {4, 3} defined over QQ
which coincides with the join of the coincident root loci associated with the partitions: ({5, 1, 1},{6, 1})
ambient: P^7 = Proj(QQ[t_0, t_1, t_2, t_3, t_4, t_5, t_6, t_7])
dim    = 6
codim  = 1
degree = 36</pre>

i14 : describe D76_1

o14 = <pre style="display:inline">
Dual of the coincident root locus associated with the partition {5, 2} defined over QQ
which coincides with the join of the coincident root loci associated with the partitions: ({4, 1, 1, 1},{7})
ambient: P^7 = Proj(QQ[t_0, t_1, t_2, t_3, t_4, t_5, t_6, t_7])
dim    = 6
codim  = 1
degree = 24</pre>

i15 : describe D76_2

o15 = <pre style="display:inline">
Coincident root locus associated with the partition {2, 1, 1, 1, 1, 1} defined over QQ
ambient: P^7 = Proj(QQ[t_0, t_1, t_2, t_3, t_4, t_5, t_6, t_7])
dim    = 6
codim  = 1
degree = 12
The singular locus is the union of the coincident root loci associated with the partitions: 
({2, 2, 1, 1, 1},{3, 1, 1, 1, 1})
The defining polynomial has 1103 terms of degree 12</pre>

i16 : 
