-- -*- M2-comint -*- hash: -1285962778

i1 : R = CC[x,y,z];

i2 : f = { x^2 - y, x^3 - z };

i3 : fe1 = constructEmbedding(f,1);

i4 : toString fe1

o4 = {x^2-y+(-.997814-.0660792*ii)*zz1, x^3-z+(-.75099+.660314*ii)*zz1, zz1, (-.98937-.145417*ii)*x+(.646692-.762751*ii)*y+(-.631067+.775728*ii)*z+(-.985354-.170524*ii)*zz1-.871139+.491036*ii}

i5 : R = CC[x,y,z];

i6 : f = { x^2-y, x^3-z, x*y-z, x*z-y^2 };

i7 : fe1 = constructEmbedding(f,1);

i8 : toString fe1

o8 = {x^2-y+(.920387+.391009*ii)*ss1+(-.887966-.459909*ii)*zz1, x^3-z+(-.854726-.519079*ii)*ss1+(.443491-.896279*ii)*zz1, x*y-z+(-.798158+.602448*ii)*ss1+(-.571741+.820434*ii)*zz1, -y^2+x*z+(.999267-.0382812*ii)*ss1+(.162877-.986646*ii)*zz1, (-.117164-.993113*ii)*x+(.70401+.710191*ii)*y+(-.914973-.403514*ii)*z+(-.970158-.242474*ii)*ss1+(-.693671-.720292*ii)*zz1+.736744-.676171*ii}

i9 : 
