-- -*- M2-comint -*- {* hash: -1285962778 *}

i1 : R = CC[x,y,z];

i2 : f = { x^2 - y, x^3 - z };

i3 : fe1 = constructEmbedding(f,1);

i4 : toString fe1

o4 = {x^2-y+(-.353209-.935545*ii)*zz1, x^3-z+(-.775228-.631682*ii)*zz1, zz1,
     (-.269608+.96297*ii)*x+(.97657-.215199*ii)*y+(.445059-.895501*ii)*z
     +(.982461+.186469*ii)*zz1+.186953-.982369*ii}

i5 : R = CC[x,y,z];

i6 : f = { x^2-y, x^3-z, x*y-z, x*z-y^2 };

i7 : fe1 = constructEmbedding(f,1);

i8 : toString fe1

o8 = {x^2-y+(.698267-.872571*ii)*ss1+(-.577368-.816484*ii)*zz1,
     x^3-z+(.741448-.234144*ii)*ss1+(.508316-.861171*ii)*zz1,
     x*y-z+(.0934718-.48384*ii)*ss1+(-.842935-.538015*ii)*zz1,
     -y^2+x*z+(.27532+.980441*ii)*ss1+(.908314+.418289*ii)*zz1,
     (.954024-.299729*ii)*x+(-.118031-.99301*ii)*y+(.244269-.969708*ii)*z
     +(-.465906+.884834*ii)*ss1+(.476603+.879119*ii)*zz1-.766019+.642817*ii}

i9 : 
