-- -*- M2-comint -*- hash: 1509569113

i1 : R=CC[a,b,c,d];

i2 : M=matrix for i to 2 list for j to 3 list random(1,R)+random(0,R);
-- warning: experimental computation over inexact field begun
--          results not reliable (one warning given per session)

             3       4
o2 : Matrix R  <--- R

i3 : I=minors(3,M);

o3 : Ideal of R

i4 : f=flatten entries gens I;

i5 : (w,ns) = topWitnessSet(f,2);
*** variables in the ring : {a, b, c, d, zz1, zz2} ***

i6 : slcmat = matrix applyTable (entries w.Slice, x->1_CC*realPart x);

                2          7
o6 : Matrix CC    <--- CC
              53         53

i7 : Rtwo = ring w.Equations;

i8 : X = transpose matrix {gens Rtwo | {1_CC}};

                7          1
o8 : Matrix Rtwo  <--- Rtwo

i9 : slcRR = flatten entries (promote(slcmat,Rtwo) * X);

i10 : fsols = intersectSlice(w,slcRR)

o10 = {{.365781+.297637*ii, .749765+.388844*ii, -1.30594-.08306*ii, .432871+.384276*ii, 3.25524e-14+1.87568e-14*ii, -3.75458e-15+6.81689e-15*ii}, {.597713-.436597*ii, .966908-.586881*ii, -1.68001+.062410*ii, .295861-.647534*ii, 9.7301e-16-5.11953e-14*ii, 2.57219e-14+1.88659e-14*ii}, {-.575477-.55914*ii, -.238876-.54412*ii, -.174796+.827466*ii, .442947+.225419*ii, -1.83826e-15-7.78905e-16*ii, -3.47465e-16-1.16721e-15*ii}, {-.269621-.478825*ii, -.081258-.731912*ii, -1.1319-.249564*ii, -.392118-1.15885*ii, -4.75021e-15+1.69284e-15*ii, -7.51926e-15+1.07102e-14*ii}, {-.311851+.698234*ii, -.030062+.509667*ii, -.736891-1.6451*ii, .09405-1.14467*ii, -7.2499e-16-1.50605e-14*ii, 1.99859e-14-1.09524e-14*ii}, {.503587+2.52423*ii, .968054+2.66636*ii, -1.20657-2.97919*ii, .805242+.049533*ii, 1.87589e-13+5.13242e-13*ii, -3.29543e-13+3.61343e-13*ii}}

o10 : List

i11 : 
