-- -*- M2-comint -*- hash: -1229619679

i1 : R = CC[x,y];

i2 : f = { x^3*y^5 + y^2 + x^2*y, x*y + x^2 - 1};

i3 : I=ideal f;

o3 : Ideal of R

i4 : dim I
-- warning: experimental computation over inexact field begun
--          results not reliable (one warning given per session)

o4 = 0

i5 : degree I

o5 = 10

i6 : m = mixedVolume(f) -- counts the number of complex roots in the torus (without zero components)

o6 = 8

i7 : (mv,sv) = mixedVolume(f,StableMixedVolume=>true)

o7 = (8, 10)

o7 : Sequence

i8 : (mv,q,qsols) = mixedVolume(f,StartSystem=>true);

i9 : q --let's take a look at the start system:

                              3 5                          2                           2                           2
o9 = {(.999211 + .0397285*ii)x y  + (- .29968 + .95404*ii)x y + (.727482 - .686127*ii)y , (- .623397 + .781906*ii)x  + (.412539 + .91094*ii)x*y - .115557 + .993301*ii}

o9 : List

i10 : qsols --and its solutions:

o10 = {{.240129-.742655*ii, -.480574-1.1238*ii}, {.177192+.740639*ii, -.340787+.442476*ii}, {-.602639-.672509*ii, .733663+.516384*ii}, {-.360551+.914761*ii, .810972+.907868*ii}, {-.678058-1.20552*ii, -.136503+.794799*ii}, {-.014035-1.36941*ii, -.830512+.013685*ii}, {.875909+.788513*ii, -.529424-.976978*ii}, {.362054+1.54618*ii, .773164-.574432*ii}}

o10 : List

i11 : 
