-- -*- M2-comint -*- hash: -1229619679

i1 : R = CC[x,y];

i2 : f = { x^3*y^5 + y^2 + x^2*y, x*y + x^2 - 1};

i3 : I=ideal f;

o3 : \displaystyle <pre style="display:inline">
Ideal</pre><pre style="display:inline">
 of </pre>\displaystyle R

i4 : dim I
-- warning: experimental computation over inexact field begun
--          results not reliable (one warning given per session)

o4 = \displaystyle 0

i5 : degree I

o5 = \displaystyle 10

i6 : m = mixedVolume(f) -- counts the number of complex roots in the torus (without zero components)

o6 = \displaystyle 8

i7 : (mv,sv) = mixedVolume(f,StableMixedVolume=>true)

o7 = \displaystyle \left(8,10\right)

i8 : (mv,q,qsols) = mixedVolume(f,StartSystem=>true);

i9 : q --let's take a look at the start system:

o9 = \displaystyle \left\{\left(-{.205377}-{.978683}\,\mathbf{i}\right)x^{3}y^{5}+\left({.943327}-{.331864}\,\mathbf{i}\right)x^{2}y,\,\left({.673112}+{.739541}\,\mathbf{i}\right)x^{2}-{.911067}-{.412259}\,\mathbf{i}\right\}

o9 : \displaystyle <pre style="display:inline">
List</pre>

i10 : qsols --and its solutions:

o10 = \displaystyle \left\{<pre style="display:inline">
Point</pre>\,\left\{\textit{ConditionNumber}\ \Rightarrow \ {1.46135},\,\textit{Coordinates}\ \Rightarrow \ \left\{{.979319}-{.202321}\,\mathbf{i},\,{.930645}-{.365923}\,\mathbf{i}\right\},\,\textit{LastT}\ \Rightarrow \ 1,\,\textit{SolutionStatus}\ \Rightarrow \ \textit{Regular}\right\},\,<pre style="display:inline">
Point</pre>\,\left\{\textit{ConditionNumber}\ \Rightarrow \ {2.40964},\,\textit{Coordinates}\ \Rightarrow \ \left\{-{.979319}+{.202321}\,\mathbf{i},\,{.916812}+{.399319}\,\mathbf{i}\right\},\,\textit{LastT}\ \Rightarrow \ 1,\,\textit{SolutionStatus}\ \Rightarrow \ \textit{Regular}\right\},\,<pre style="display:inline">
Point</pre>\,\left\{\textit{ConditionNumber}\ \Rightarrow \ {2.31696},\,\textit{Coordinates}\ \Rightarrow \ \left\{{.979319}-{.202321}\,\mathbf{i},\,{.365923}+{.930645}\,\mathbf{i}\right\},\,\textit{LastT}\ \Rightarrow \ 1,\,\textit{SolutionStatus}\ \Rightarrow \ \textit{Regular}\right\},\,<pre style="display:inline">
Point</pre>\,\left\{\textit{ConditionNumber}\ \Rightarrow \ {2.18055},\,\textit{Coordinates}\ \Rightarrow \ \left\{-{.979319}+{.202321}\,\mathbf{i},\,-{.399319}+{.916812}\,\mathbf{i}\right\},\,\textit{LastT}\ \Rightarrow \ 1,\,\textit{SolutionStatus}\ \Rightarrow \ \textit{Regular}\right\},\,<pre style="display:inline">
Point</pre>\,\left\{\textit{ConditionNumber}\ \Rightarrow \ {2.17439},\,\textit{Coordinates}\ \Rightarrow \ \left\{{.979319}-{.202321}\,\mathbf{i},\,-{.930645}+{.365923}\,\mathbf{i}\right\},\,\textit{LastT}\ \Rightarrow \ 1,\,\textit{SolutionStatus}\ \Rightarrow \ \textit{Regular}\right\},\,<pre style="display:inline">
Point</pre>\,\left\{\textit{ConditionNumber}\ \Rightarrow \ {1.82149},\,\textit{Coordinates}\ \Rightarrow \ \left\{-{.979319}+{.202321}\,\mathbf{i},\,-{.916812}-{.399319}\,\mathbf{i}\right\},\,\textit{LastT}\ \Rightarrow \ 1,\,\textit{SolutionStatus}\ \Rightarrow \ \textit{Regular}\right\},\,<pre style="display:inline">
Point</pre>\,\left\{\textit{ConditionNumber}\ \Rightarrow \ {2.53357},\,\textit{Coordinates}\ \Rightarrow \ \left\{{.979319}-{.202321}\,\mathbf{i},\,-{.365923}-{.930645}\,\mathbf{i}\right\},\,\textit{LastT}\ \Rightarrow \ 1,\,\textit{SolutionStatus}\ \Rightarrow \ \textit{Regular}\right\},\,<pre style="display:inline">
Point</pre>\,\left\{\textit{ConditionNumber}\ \Rightarrow \ {2.41663},\,\textit{Coordinates}\ \Rightarrow \ \left\{-{.979319}+{.202321}\,\mathbf{i},\,{.399319}-{.916812}\,\mathbf{i}\right\},\,\textit{LastT}\ \Rightarrow \ 1,\,\textit{SolutionStatus}\ \Rightarrow \ \textit{Regular}\right\}\right\}

o10 : \displaystyle <pre style="display:inline">
List</pre>

i11 : 
