-- -*- M2-comint -*- {* hash: -1229619679 *}

i1 : R = CC[x,y];

i2 : f = { x^3*y^5 + y^2 + x^2*y, x*y + x^2 - 1};

i3 : I=ideal f;

o3 : Ideal of R

i4 : dim I
-- warning: experimental computation over inexact field begun
--          results not reliable (one warning given per session)

o4 = 0

i5 : degree I

o5 = 10

i6 : m = mixedVolume(f) -- counts the number of complex roots in the torus (without zero components)

o6 = 8

i7 : (mv,sv) = mixedVolume(f,StableMixedVolume=>true)

o7 = (8, 10)

o7 : Sequence

i8 : (mv,q,qsols) = mixedVolume(f,StartSystem=>true);

i9 : q --let's take a look at the start system:

                             3 5                            2             
o9 = {(.536639 - .843812*ii)x y  + (- .960158 + .279458*ii)x y, (.746596 -
     ------------------------------------------------------------------------
                 2
     .665278*ii)x  + (.992313 + .123751*ii)x*y + .704778 - .709428*ii}

o9 : List

i10 : qsols --and its solutions:

o10 = {{-.296956+.665448*ii, 1.02829-.337746*ii}, {.252808+.610316*ii,
      -----------------------------------------------------------------------
      .126444+1.10198*ii}, {.017880-.581105*ii, -.967054-.613442*ii},
      -----------------------------------------------------------------------
      {-.10855-1.53838*ii, .745355+.499693*ii}, {.499752-1.01646*ii,
      -----------------------------------------------------------------------
      -.42924+.869117*ii}, {.480218+1.30259*ii, -.914167+.114052*ii},
      -----------------------------------------------------------------------
      {-.313972+1.42018*ii, -.240087-.878372*ii}, {-.53118-.862593*ii,
      -----------------------------------------------------------------------
      .650459-.755284*ii}}

o10 : List

i11 : 
