-- -*- M2-comint -*- {* hash: -1010838168 *}

i1 : R = CC[x,y,z];

i2 : f = { x^2 - y, x^3 - z };

i3 : (w,ns) = topWitnessSet(f,1)

o3 = (w, {})

o3 : Sequence

i4 : dim(w)

o4 = 1

i5 : degree(w)

o5 = 3

i6 : toString equations(w)

o6 = {x^2-y+(.957778-.287509*ii)*zz1, x^3-z+(.899916-.436064*ii)*zz1, zz1}

i7 : toString slice(w)

o7 = {(.975892+.218256*ii)*x+(-.945549-.32548*ii)*y+(-.235937+.971768*ii)*z
     +(.680539-.732712*ii)*zz1-.390561+.920577*ii}

i8 : toString points(w)

o8 = VerticalList{{.134559-.957208*ii, -.898141-.257602*ii,
     -.367431+.825045*ii, 0}, {.69037+.70861*ii, -.025518+.978407*ii,
     -.710926+.657381*ii, -4.34949e-32-5.15366e-33*ii}, {-.731727-.74705*ii,
     -.022658+1.09327*ii, .833309-.783051*ii, 0}}

i9 : R = CC[x,y,z]; f = { (x^2-y)*(x-2), (x^3 - z)*(y-2), (x*y - z)*(z-2) }

        3     2              3      3                             2
o10 = {x  - 2x  - x*y + 2y, x y - 2x  - y*z + 2z, x*y*z - 2x*y - z  + 2z}

o10 : List

i11 : (w,ns) = topWitnessSet(f,1);

i12 : dim(w)

o12 = 1

i13 : degree(w)

o13 = 3

i14 : #ns

o14 = 10

i15 : 
